{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 3], "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "trainable": true, "filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "padding": "valid", "name": "max_pooling2d", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 3], "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense", "use_bias": true, "units": 1024, "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "name": "dropout", "seed": null, "noise_shape": null, "rate": 0.4}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "units": 10, "bias_constraint": null, "activation": "relu"}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "softmax"}}], "name": "sequential"}}