{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Reshape", "config": {"target_shape": [28, 28, 3], "trainable": true, "dtype": "float32", "batch_input_shape": [null, 28, 28, 3], "name": "reshape_3"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "kernel_constraint": null, "dtype": "float32", "units": 500, "name": "dense_7", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "max_value": null, "dtype": "float32", "trainable": true, "name": "re_lu"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "kernel_constraint": null, "dtype": "float32", "units": 10, "name": "dense_8", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "max_value": null, "dtype": "float32", "trainable": true, "name": "re_lu_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation_3"}}], "name": "sequential_4"}, "backend": "tensorflow"}